'use strict';

//--------------------------------------------------------------------------------
// 設定ファイルの読み込み
//--------------------------------------------------------------------------------
const path = require('../path');

//--------------------------------------------------------------------------------
// 設定のエクスポート
//--------------------------------------------------------------------------------
module.exports = {
  // 対象ファイル
  src: path.srcDir + path.jsDir + '**/*.js',
  // 出力先
  dest: {
    build: path.buildDir + path.jsDir,
    release: path.releaseDir + path.jsDir
  },
  // Babel preset-envの設定
  preset: {
    'presets': [
      ['env', {
        'targets': {
          'browsers': [
            'last 2 versions',
            'ie >= 11',
            'iOS >= 10',
            'Android >= 5'
          ]
        }
      }]
    ]
  }
};
